benchmarks/v10/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontAndBack
    {
        type            patch;
        nFaces          2880;
        startFace       100224;
    }
    inlet
    {
        type            patch;
        nFaces          576;
        startFace       103104;
    }
    outlet
    {
        type            patch;
        nFaces          576;
        startFace       103680;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1440;
        startFace       104256;
    }
    upperWall
    {
        type            patch;
        nFaces          1440;
        startFace       105696;
    }
)

// ************************************************************************* //
